DataProcessors/ЗарплатаПроцентОтПродажАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ЗарплатаПроцентОтПродажАвтомобилей</Name>
			<Comment>Зарплата процент от продаж автомобилей</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ПродажиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиАвтомобилей</Name>
			<Comment>Блок учета продаж автомобилей</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество проданных автомобилей</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыручкаБезНДС</Name>
					<Comment>Выручка в валюте регл. учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыручкаДоПримененияСкидки</Name>
					<Comment>Выручка до применения скидки с НДС в валюте регл. учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыручкаДоПримененияСкидкиБезНДС</Name>
					<Comment>Выручка до применения скидки в валюте регл. учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСУпр</Name>
					<Comment>Сумма НДС в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыручкаБезНДСУпр</Name>
					<Comment>Выручка в валюте управленческого учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидкиУпр</Name>
					<Comment>Сумма скидки в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыручкаДоПримененияСкидкиУпр</Name>
					<Comment>Выручка до применения скидки с НДС в валюте управленческого учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыручкаДоПримененияСкидкиБезНДСУпр</Name>
					<Comment>Выручка до применения скидки в валюте управленческого учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Comment>Себестоимость регл. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСВходящий</Name>
					<Comment>Сумма входящего НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьБезНДС</Name>
					<Comment>Себестоимость регл. учета без учета налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьУпр</Name>
					<Comment>Себестоимость упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСВходящийУпр</Name>
					<Comment>Сумма входящего НДС в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьБезНДСУпр</Name>
					<Comment>Себестоимость упр. учета без учета налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был зафиксирован факт продажи товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Проданный автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателяАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераЗаАвтомобили</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщик у которого автомобиль был куплен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Покупатель который купил автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей автомобиль мы продали (собственный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с покупателем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании с которого автомобиль был продан</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусыПартий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыПартий</Name>
			<Comment>Статусы партий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТоварКупленный</Name>
					<Comment>Товар (купленный)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварПринятыйКомиссия</Name>
					<Comment>Товар (принятый на комиссию)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварОтветственноеХранение</Name>
					<Comment>Товар (ответственное хранение)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ЗарплатаПроцентОтПродажАвтомобилей/Ext/ObjectModule.bsl
#Область ОписаниеПеременных

Перем ДатаНачала Экспорт; // Дата начала интервала расчета
Перем ДатаКонца Экспорт;  // Дата конца интервала расчета
Перем Сотрудник Экспорт;  // Ссылка на сотрудника по которому производится расчет

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Фукнция расчета базовой суммы
Функция БазоваяСумма() Экспорт
	БазоваяСумма=0;
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		ТекстЗапроса ="ВЫБРАТЬ
			|	ЕСТЬNULL(СУММА(тбл.СуммаКупленныеАвто), 0) КАК СуммаКупленныеАвто,
			|	ЕСТЬNULL(СУММА(тбл.СуммаКупленныеТовары), 0) КАК СуммаКупленныеТовары,
			|	ЕСТЬNULL(СУММА(тбл.СуммаПринятыеАвто), 0) КАК СуммаПринятыеАвто,
			|	ЕСТЬNULL(СУММА(тбл.СуммаПринятыеТовары), 0) КАК СуммаПринятыеТовары,
			|	ЕСТЬNULL(СУММА(тбл.СуммаОтданныеАвто), 0) КАК СуммаОтданныеАвто,
			|	ЕСТЬNULL(СУММА(тбл.СуммаОтданныеТовары), 0) КАК СуммаОтданныеТовары
			|ИЗ
			|	(ВЫБРАТЬ
			|		ЕСТЬNULL(ПродажиАвтомобилейОбороты.СуммаУпрОборот, 0) КАК СуммаКупленныеАвто,
			|		0 КАК СуммаКупленныеТовары,
			|		0 КАК СуммаПринятыеАвто,
			|		0 КАК СуммаПринятыеТовары,
			|		0 КАК СуммаОтданныеАвто,
			|		0 КАК СуммаОтданныеТовары
			|	ИЗ
			|		РегистрНакопления.ПродажиАвтомобилей.Обороты(&ДатаНачала, &ДатаКонца, Регистратор, СтатусПартии = &СтатусПартииКупленный) КАК ПродажиАвтомобилейОбороты
			|	ГДЕ
			|		ПродажиАвтомобилейОбороты.Регистратор ССЫЛКА Документ.РеализацияАвтомобилей
			|		И ПродажиАвтомобилейОбороты.Регистратор.Менеджер = &Менеджер
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		0,
			|		ЕСТЬNULL(ПродажиОбороты.СуммаУпрОборот, 0),
			|		0,
			|		0,
			|		0,
			|		0
			|	ИЗ
			|		РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаКонца, Регистратор, СтатусПартии = &СтатусПартииКупленный) КАК ПродажиОбороты
			|	ГДЕ
			|		ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияАвтомобилей
			|		И ПродажиОбороты.Регистратор.Менеджер = &Менеджер
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		0,
			|		0,
			|		ЕСТЬNULL(РеализованныеАвтомобили1.СуммаПродажиПриход, 0),
			|		0,
			|		0,
			|		0
			|	ИЗ
			|		РегистрНакопления.РеализованныеАвтомобили.Обороты(&ДатаНачала, &ДатаКонца, Регистратор, ) КАК РеализованныеАвтомобили
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РеализованныеАвтомобили.Обороты(, , Регистратор, ) КАК РеализованныеАвтомобили1
			|			ПО РеализованныеАвтомобили.ДокументПередачи = РеализованныеАвтомобили1.ДокументПередачи
			|				И РеализованныеАвтомобили.Автомобиль = РеализованныеАвтомобили1.Автомобиль
			|				И РеализованныеАвтомобили.Контрагент = РеализованныеАвтомобили1.Контрагент
			|				И РеализованныеАвтомобили.ДоговорВзаиморасчетов = РеализованныеАвтомобили1.ДоговорВзаиморасчетов
			|				И (РеализованныеАвтомобили.Регистратор ССЫЛКА Документ.ОтчетКомитентуЗаАвтомобили)
			|				И (РеализованныеАвтомобили1.Регистратор ССЫЛКА Документ.РеализацияАвтомобилей)
			|				И (РеализованныеАвтомобили1.Регистратор.Менеджер = &Менеджер)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		0,
			|		0,
			|		0,
			|		ЕСТЬNULL(РеализованныеТовары1.СуммаПродажиПриход, 0),
			|		0,
			|		0
			|	ИЗ
			|		РегистрНакопления.РеализованныеТовары.Обороты(&ДатаНачала, &ДатаКонца, Регистратор, ) КАК РеализованныеТовары
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РеализованныеТовары.Обороты(, , Регистратор, ) КАК РеализованныеТовары1
			|			ПО РеализованныеТовары.ДокументПередачи = РеализованныеТовары1.ДокументПередачи
			|				И РеализованныеТовары.Номенклатура = РеализованныеТовары1.Номенклатура
			|				И РеализованныеТовары.ХарактеристикаНоменклатуры = РеализованныеТовары1.ХарактеристикаНоменклатуры
			|				И РеализованныеТовары.Контрагент = РеализованныеТовары1.Контрагент
			|				И РеализованныеТовары.ДоговорВзаиморасчетов = РеализованныеТовары1.ДоговорВзаиморасчетов
			|				И (РеализованныеТовары.Регистратор ССЫЛКА Документ.ОтчетКомитенту)
			|				И (РеализованныеТовары1.Регистратор ССЫЛКА Документ.РеализацияАвтомобилей)
			|				И (РеализованныеТовары1.Регистратор.Менеджер = &Менеджер)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		0,
			|		0,
			|		0,
			|		0,
			|		ЕСТЬNULL(АвтомобилиОтданныеОбороты.СуммаУпрРасход, 0),
			|		0
			|	ИЗ
			|		РегистрНакопления.АвтомобилиОтданные.Обороты(&ДатаНачала, &ДатаКонца, Регистратор, ДокументПередачи.Менеджер = &Менеджер) КАК АвтомобилиОтданныеОбороты
			|	ГДЕ
			|		АвтомобилиОтданныеОбороты.Регистратор ССЫЛКА Документ.ОтчетКомиссионераЗаАвтомобили
			|		И АвтомобилиОтданныеОбороты.ДокументПередачи ССЫЛКА Документ.РеализацияАвтомобилей
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		0,
			|		0,
			|		0,
			|		0,
			|		0,
			|		ЕСТЬNULL(ПартииТоваровОтданныеОбороты.СуммаУпрРасход, 0)
			|	ИЗ
			|		РегистрНакопления.ПартииТоваровОтданные.Обороты(&ДатаНачала, &ДатаКонца, Регистратор, ДокументПередачи.Менеджер = &Менеджер) КАК ПартииТоваровОтданныеОбороты
			|	ГДЕ
			|		ПартииТоваровОтданныеОбороты.Регистратор ССЫЛКА Документ.ОтчетКомиссионераЗаАвтомобили
			|		И ПартииТоваровОтданныеОбороты.ДокументПередачи ССЫЛКА Документ.РеализацияАвтомобилей) КАК тбл";
		Запрос = Новый Запрос();
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ДатаНачала", Новый Граница(НачалоДня(ДатаНачала),ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ДатаКонца", Новый Граница(КонецДня(ДатаКонца),ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Менеджер", Сотрудник);
		Запрос.УстановитьПараметр("СтатусПартииКупленный", Перечисления.СтатусыПартий.ТоварКупленный);
		// выполняем запрос
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			БазоваяСумма = Выборка.СуммаКупленныеАвто + Выборка.СуммаКупленныеТовары
						+ Выборка.СуммаПринятыеАвто + Выборка.СуммаПринятыеТовары
						+ Выборка.СуммаОтданныеАвто + Выборка.СуммаОтданныеТовары;
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат БазоваяСумма;
КонецФункции

#КонецОбласти
